app/views/purchase_histories/index.html.erb

      <% PurchaseHistory.where("user_id != ''").each do |purchase_history| %>
        <% user = User.find(purchase_history.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 3], ["LIMIT", 1]]