app/views/carts/index.html.erb

SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    <% @carts.each do |cart| %>
      <% item = Item.find(cart.item_id) %>