app/views/items/index.html.erb

    <% category_select_options = [] %>
    <% Item.where("category != ''").each do |item| %>
---
SELECT "items".* FROM "items" WHERE (category != '')

    <% brand_select_options = [] %>
    <% Item.where("brand != ''").each do |item| %>
---
SELECT "items".* FROM "items" WHERE (brand != '')