app/controllers/credit_cards_controller.rb

  def index
    @credit_cards = CreditCard.select{|card| card.user_id.equal?(current_user.id)}
---
SELECT "credit_cards".* FROM "credit_cards"

  def create
    @credit_card = CreditCard.new(credit_card_params)

    respond_to do |format|
      if @credit_card.save
---
INSERT INTO "credit_cards" ("user_id", "card_name", "card_num", "card_experation", "card_cvv", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_credit_card
      @credit_card = CreditCard.find(params[:id])
---
SELECT "credit_cards".* FROM "credit_cards" WHERE "credit_cards"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]