app/controllers/items_controller.rb

  def index
    if params[:order_by]
      @items = Item.all.order(params[:order_by])
    elsif params[:search_category]
      @items = Item.search_category(params[:search_category])
    elsif params[:search_brand]
      @items = Item.search_brand(params[:search_brand])
    elsif params[:search_availability]
      @items = Item.search_availability(params[:search_availability])
    else
      @items = Item.all
---
SELECT "items".* FROM "items" WHERE (category != '')
SELECT "items".* FROM "items" WHERE "items"."brand" = ?  [["brand", "Fuji"]]

  def show
    @popularity = @item.views_count
    if @popularity.nil?
      @popularity = 0
    end
    @popularity += 1
    @item.views_count = @popularity
    @item.save
---
UPDATE "items" SET "views_count" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["views_count", 1], ["updated_at", "2020-02-21 20:36:47.385130"], ["id", 1]]