app/controllers/purchase_histories_controller.rb

  def index
    if current_user.admin?
      if !params[:item_search].nil?
        @purchase_histories = PurchaseHistory.where(item_id: params[:item_search])
      elsif !params[:user_search].nil?
        @purchase_histories = PurchaseHistory.where(user_id: params[:user_search])
      else
        @purchase_histories = PurchaseHistory.all
---
SELECT "purchase_histories".* FROM "purchase_histories"