app/controllers/registrations_controller.rb

	def keep_admin_logged_in
		if raise_admin_flag?
    		sign_out(:user)
    		sign_in(User.first, :bypass => true)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]