app/controllers/wishlists_controller.rb

  def index
    @wishlists = Wishlist.where(user_id: current_user.id)
---
SELECT "wishlists".* FROM "wishlists" WHERE "wishlists"."user_id" = ?  [["user_id", 1]]

  def create
    @wishlists = Wishlist.where(user_id: current_user.id)
    if @wishlists.any? and Wishlist.where(user_id: current_user.id).where(item_id: wishlist_params[:item_id]).take
      flash[:notice] = 'Item already on wishlist!'
      redirect_to items_url
    else
      @wishlist = Wishlist.new(wishlist_params)

      respond_to do |format|
        if @wishlist.save
---
SELECT "wishlists".* FROM "wishlists" WHERE "wishlists"."user_id" = ? AND "wishlists"."item_id" = ? LIMIT ?  [["user_id", 3], ["item_id", 3], ["LIMIT", 1]]
SELECT 1 AS one FROM "wishlists" WHERE "wishlists"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
INSERT INTO "wishlists" ("user_id", "created_at", "updated_at", "item_id") VALUES (?, ?, ?, ?)  [["user_id", 3], ["created_at", "2020-02-21 20:37:18.481426"], ["updated_at", "2020-02-21 20:37:18.481426"], ["item_id", 1]]

    def set_wishlist
      @wishlist = Wishlist.find(params[:id])
---
SELECT "wishlists".* FROM "wishlists" WHERE "wishlists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]